jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/


/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "TLE9563_RegLayer.h"
#include "TLE9563_CommLayer.h"

/*******************************************************************************
**                           Local Macro Definitions                          **
*******************************************************************************/


/*******************************************************************************
**                           Local Type Definitions                           **
*******************************************************************************/


/******************************************************************************/
/**                        Local Variable Definitions                        **/
/******************************************************************************/


/******************************************************************************/
/**                        Local Function Definitions                        **/
/******************************************************************************/


/*******************************************************************************
**                        Global Variable Definitions                         **
*******************************************************************************/


/*******************************************************************************
**                         Global Function Definitions                        **
*******************************************************************************/
/** \brief Recovery SPI command in case of mismatch of CRC setting between the device and µC
 * 
 *  \return void no return value
 */
void TLE9563_resetCrc(uint16_t u16_data)
{
  TLE9563_sendStaticCrcRecovery();
}

/** \brief Sets the device register for Mode and Supply Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setMSCTRL(uint16_t u16_data)
{
  TLE9563->M_S_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_MSCTRL_ADDR, u16_data);
  
  /* in case of software reset, registers are reseted */
  if(TLE9563->M_S_CTRL.bit.MODE == 3)
  {
    TLE9563->M_S_CTRL.reg = 0x0000;
    TLE9563->HW_CTRL.reg = (uint16_t)TLE9563->HW_CTRL.reg & 0x0200;
    TLE9563->WD_CTRL.reg = 0x0014;
    TLE9563->BUS_CTRL.reg = 0x0020;
    TLE9563->WK_CTRL_BNK3.reg = 0x0023;
    TLE9563->WK_CTRL_BNK4.reg = 0x0024;
    TLE9563->TIMER_CTRL.reg = 0x0000;
    TLE9563->SW_SD_CTRL.reg = 0x0000;
    TLE9563->HS_CTRL.reg = 0x0000;
    TLE9563->INT_MASK.reg = 0x0120;
    TLE9563->PWM_CTRL_BNK0.reg = 0x0000;
    TLE9563->PWM_CTRL_BNK1.reg = 0x0001;
    TLE9563->PWM_CTRL_BNK2.reg = 0x0002;
    TLE9563->PWM_CTRL_BNK3.reg = 0x0003;
    TLE9563->SYS_STAT_CTRL.reg = 0x0000;
    TLE9563->GENCTRL.reg = 0x0801;
    TLE9563->CSA.reg = 0x0121;
    TLE9563->LS_VDS.reg = 0x0049;
    TLE9563->HS_VDS.reg = 0x0049;
    TLE9563->CCP_BLK_BNK0.reg = 0x7700;
    TLE9563->CCP_BLK_BNK1.reg = 0x7701;
    TLE9563->CCP_BLK_BNK2.reg = 0x7702;
    TLE9563->CCP_BLK_BNK4.reg = 0x7704;
    TLE9563->CCP_BLK_BNK5.reg = 0x7705;
    TLE9563->CCP_BLK_BNK6.reg = 0x7706;
    TLE9563->HBMODE.reg = 0x0222;
    TLE9563->TPRECHG_BNK0.reg = 0x0000;
    TLE9563->TPRECHG_BNK1.reg = 0x0001;
    TLE9563->ST_ICHG.reg = 0x0444;
    TLE9563->HB_ICHG_BNK0.reg = 0x3CD0;
    TLE9563->HB_ICHG_BNK1.reg = 0x3CD1;
    TLE9563->HB_ICHG_BNK2.reg = 0x3CD2;
    TLE9563->HB_ICHG_BNK4.reg = 0x3CD4;
    TLE9563->HB_ICHG_BNK5.reg = 0x3CD5;
    TLE9563->HB_ICHG_BNK6.reg = 0x3CD6;
    TLE9563->HB_ICHG_MAX.reg = 0x0000;
    TLE9563->HB_PCHG_INIT_BNK0.reg = 0x3CD0;
    TLE9563->HB_PCHG_INIT_BNK1.reg = 0x3CD1;
    TLE9563->HB_PCHG_INIT_BNK2.reg = 0x3CD2;
    TLE9563->TDON_HB_CTRL_BNK0.reg = 0x0C00;
    TLE9563->TDON_HB_CTRL_BNK1.reg = 0x0C01;
    TLE9563->TDON_HB_CTRL_BNK2.reg = 0x0C02;
    TLE9563->TDOFF_HB_CTRL_BNK0.reg = 0x0C00;
    TLE9563->TDOFF_HB_CTRL_BNK1.reg = 0x0C01;
    TLE9563->TDOFF_HB_CTRL_BNK2.reg = 0x0C02;
    TLE9563->BRAKE.reg = 0x00A0;
    TLE9563->SWK_CTRL.reg = 0x0000;
    TLE9563->SWK_BTL1_CTRL.reg = 0xCC96;
    TLE9563->SWK_ID0_CTRL.reg = 0x0000; 
    TLE9563->SWK_ID1_CTRL.reg = 0x0000;
    TLE9563->SWK_MASK_ID1_CTRL.reg = 0x0000;
    TLE9563->SWK_MASK_ID0_CTRL.reg = 0x0000;
    TLE9563->SWK_DATA3_CTRL.reg = 0x0000;
    TLE9563->SWK_DATA2_CTRL.reg = 0x0000; 
    TLE9563->SWK_DATA1_CTRL.reg = 0x0000; 
    TLE9563->SWK_DATA0_CTRL.reg = 0x0000;
    TLE9563->SWK_CAN_FD_CTRL.reg = 0x0000; 
    TLE9563->SWK_OSC_TRIM_CTRL.reg = 0x0000;
    TLE9563->SWK_CDR_CTRL.reg = 0x0004; 
    TLE9563->SWK_CDR_LIMIT.reg = 0x9D8F; 
    TLE9563->SWK_DLC_CTRL.reg = 0x0000; 
  }
}

/** \brief Gets the device register for Mode and Supply Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getMSCTRL(void)
{
  TLE9563_getReg(TLE9563_MSCTRL_ADDR);
}

/** \brief Sets the device register for Hardware Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHWCTRL(uint16_t u16_data)
{
  TLE9563->HW_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_HWCTRL_ADDR, u16_data);
}

