jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/** \brief Gets the device register for Hardware Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getHWCTRL(void)
{
  TLE9563_getReg(TLE9563_HWCTRL_ADDR);
}

/** \brief Sets the device register for Watchdog Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setWDCTRL(uint16_t u16_data)
{
  TLE9563->WD_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_WDCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for Watchdog Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getWDCTRL(void)
{
  TLE9563_getReg(TLE9563_WDCTRL_ADDR);
}

/** \brief Sets the device register for CAN Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setBUSCTRL(uint16_t u16_data)
{
  TLE9563->BUS_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_BUSCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for CAN Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getBUSCTRL(void)
{
  TLE9563_getReg(TLE9563_BUSCTRL_ADDR);
}

/** \brief Sets the device register for Wake-up Control via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setWKCTRLBNK3(uint16_t u16_data)
{
  TLE9563->WK_CTRL_BNK3.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_011);
  TLE9563_setBankReg(TLE9563_WKCTRLBNK3_ADDR, DEVICE_regBank_011, u16_data);
}

/** \brief Gets the device register for Wake-up Control via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getWKCTRLBNK3(void)
{
  TLE9563_getBankReg(TLE9563_WKCTRLBNK3_ADDR, DEVICE_regBank_011);
}

/** \brief Sets the device register for Wake-up Control via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setWKCTRLBNK4(uint16_t u16_data)
{
  TLE9563->WK_CTRL_BNK4.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_100);
  TLE9563_setBankReg(TLE9563_WKCTRLBNK4_ADDR, DEVICE_regBank_100, u16_data);
}

/** \brief Gets the device register for Wake-up Control via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getWKCTRLBNK4(void)
{
  TLE9563_getBankReg(TLE9563_WKCTRLBNK4_ADDR, DEVICE_regBank_100);
}

/** \brief Sets the device register for Timer 1 and Timer2 Control and Selection via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTIMERCTRL(uint16_t u16_data)
{
  TLE9563->TIMER_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_TIMERCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for Timer 1 and Timer2 Control and Selection via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getTIMERCTRL(void)
{
  TLE9563_getReg(TLE9563_TIMERCTRL_ADDR);
}

/** \brief Sets the device register for High-Side Switch Shutdown Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWSDCTRL(uint16_t u16_data)
{
  TLE9563->SW_SD_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWSDCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for High-Side Switch Shutdown Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWSDCTRL(void)
{
  TLE9563_getReg(TLE9563_SWSDCTRL_ADDR);
}

/** \brief Sets the device register for High-Side Switch Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHSCTRL(uint16_t u16_data)
{
  TLE9563->HS_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_HSCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for High-Side Switch Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getHSCTRL(void)
{
  TLE9563_getReg(TLE9563_HSCTRL_ADDR);
}

/** \brief Sets the device register for Interrupt Mask Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setINTMASK(uint16_t u16_data)
{
  TLE9563->INT_MASK.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_INTMASK_ADDR, u16_data);
}

/** \brief Gets the device register for Interrupt Mask Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getINTMASK(void)
{
  TLE9563_getReg(TLE9563_INTMASK_ADDR);
}

/** \brief Sets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setPWMCTRLBNK0(uint16_t u16_data)
{
  TLE9563->PWM_CTRL_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_PWMCTRLBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getPWMCTRLBNK0(void)
{
  TLE9563_getBankReg(TLE9563_PWMCTRLBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setPWMCTRLBNK1(uint16_t u16_data)
{
  TLE9563->PWM_CTRL_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_PWMCTRLBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getPWMCTRLBNK1(void)
{
  TLE9563_getBankReg(TLE9563_PWMCTRLBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setPWMCTRLBNK2(uint16_t u16_data)
{
  TLE9563->PWM_CTRL_BNK2.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_010);
  TLE9563_setBankReg(TLE9563_PWMCTRLBNK2_ADDR, DEVICE_regBank_010, u16_data);
}

/** \brief Gets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getPWMCTRLBNK2(void)
{
  TLE9563_getBankReg(TLE9563_PWMCTRLBNK2_ADDR, DEVICE_regBank_010);
}

/** \brief Sets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setPWMCTRLBNK3(uint16_t u16_data)
{
  TLE9563->PWM_CTRL_BNK3.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_011);
  TLE9563_setBankReg(TLE9563_PWMCTRLBNK3_ADDR, DEVICE_regBank_011, u16_data);
}

/** \brief Gets the device register for PWM Configuration Control via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getPWMCTRLBNK3(void)
{
  TLE9563_getBankReg(TLE9563_PWMCTRLBNK3_ADDR, DEVICE_regBank_011);
}

