jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/** \brief Sets the device register for System Status Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSYSSTATCTRL(uint16_t u16_data)
{
  TLE9563->SYS_STAT_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SYSSTATCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for System Status Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSYSSTATCTRL(void)
{
  TLE9563_getReg(TLE9563_SYSSTATCTRL_ADDR);
}

/** \brief Sets the device register for General Bridge Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setGENCTRL(uint16_t u16_data)
{
  TLE9563->GENCTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_GENCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for General Bridge Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getGENCTRL(void)
{
  TLE9563_getReg(TLE9563_GENCTRL_ADDR);
}

/** \brief Sets the device register for Current sense amplifier via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCSA(uint16_t u16_data)
{
  TLE9563->CSA.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_CSA_ADDR, u16_data);
}

/** \brief Gets the device register for Current sense amplifier via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getCSA(void)
{
  TLE9563_getReg(TLE9563_CSA_ADDR);
}

/** \brief Sets the device register for VDS monitoring threshold LS1-3 via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setLSVDS(uint16_t u16_data)
{
  TLE9563->LS_VDS.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_LSVDS_ADDR, u16_data);
}

/** \brief Gets the device register for VDS monitoring threshold LS1-3 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getLSVDS(void)
{
  TLE9563_getReg(TLE9563_LSVDS_ADDR);
}

/** \brief Sets the device register for VDS monitoring threshold HS1-3 via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHSVDS(uint16_t u16_data)
{
  TLE9563->HS_VDS.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_HSVDS_ADDR, u16_data);
}

/** \brief Gets the device register for VDS monitoring threshold HS1-3 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getHSVDS(void)
{
  TLE9563_getReg(TLE9563_HSVDS_ADDR);
}

/** \brief Sets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCCPBLKBNK0(uint16_t u16_data)
{
  TLE9563->CCP_BLK_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_CCPBLKBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getCCPBLKBNK0(void)
{
  TLE9563_getBankReg(TLE9563_CCPBLKBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCCPBLKBNK1(uint16_t u16_data)
{
  TLE9563->CCP_BLK_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_CCPBLKBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getCCPBLKBNK1(void)
{
  TLE9563_getBankReg(TLE9563_CCPBLKBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCCPBLKBNK2(uint16_t u16_data)
{
  TLE9563->CCP_BLK_BNK2.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_010);
  TLE9563_setBankReg(TLE9563_CCPBLKBNK2_ADDR, DEVICE_regBank_010, u16_data);
}

/** \brief Gets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getCCPBLKBNK2(void)
{
  TLE9563_getBankReg(TLE9563_CCPBLKBNK2_ADDR, DEVICE_regBank_010);
}

/** \brief Sets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCCPBLKBNK4(uint16_t u16_data)
{
  TLE9563->CCP_BLK_BNK4.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_100);
  TLE9563_setBankReg(TLE9563_CCPBLKBNK4_ADDR, DEVICE_regBank_100, u16_data);
}

/** \brief Gets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getCCPBLKBNK4(void)
{
  TLE9563_getBankReg(TLE9563_CCPBLKBNK4_ADDR, DEVICE_regBank_100);
}

/** \brief Sets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCCPBLKBNK5(uint16_t u16_data)
{
  TLE9563->CCP_BLK_BNK5.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_101);
  TLE9563_setBankReg(TLE9563_CCPBLKBNK5_ADDR, DEVICE_regBank_101, u16_data);
}

/** \brief Gets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getCCPBLKBNK5(void)
{
  TLE9563_getBankReg(TLE9563_CCPBLKBNK5_ADDR, DEVICE_regBank_101);
}

/** \brief Sets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setCCPBLKBNK6(uint16_t u16_data)
{
  TLE9563->CCP_BLK_BNK6.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_110);
  TLE9563_setBankReg(TLE9563_CCPBLKBNK6_ADDR, DEVICE_regBank_110, u16_data);
}

/** \brief Gets the device register for CCP and times selection via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getCCPBLKBNK6(void)
{
  TLE9563_getBankReg(TLE9563_CCPBLKBNK6_ADDR, DEVICE_regBank_110);
}

/** \brief Sets the device register for Half-Bridge MODE via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBMODE(uint16_t u16_data)
{
  TLE9563->HBMODE.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_HBMODE_ADDR, u16_data);
}

