jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/** \brief Gets the device register for Half-Bridge MODE via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getHBMODE(void)
{
  TLE9563_getReg(TLE9563_HBMODE_ADDR);
}

/** \brief Sets the device register for HB pre-charge and pre-discharge time via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTPRECHGBNK0(uint16_t u16_data)
{
  TLE9563->TPRECHG_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_TPRECHGBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for HB pre-charge and pre-discharge time via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTPRECHGBNK0(void)
{
  TLE9563_getBankReg(TLE9563_TPRECHGBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for HB pre-charge and pre-discharge time via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTPRECHGBNK1(uint16_t u16_data)
{
  TLE9563->TPRECHG_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_TPRECHGBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for HB pre-charge and pre-discharge time via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTPRECHGBNK1(void)
{
  TLE9563_getBankReg(TLE9563_TPRECHGBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for Static charge/discharge current via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSTICHG(uint16_t u16_data)
{
  TLE9563->ST_ICHG.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_STICHG_ADDR, u16_data);
}

/** \brief Gets the device register for Static charge/discharge current via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSTICHG(void)
{
  TLE9563_getReg(TLE9563_STICHG_ADDR);
}

/** \brief Sets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGBNK0(uint16_t u16_data)
{
  TLE9563->HB_ICHG_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_HBICHGBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGBNK0(void)
{
  TLE9563_getBankReg(TLE9563_HBICHGBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGBNK1(uint16_t u16_data)
{
  TLE9563->HB_ICHG_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_HBICHGBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGBNK1(void)
{
  TLE9563_getBankReg(TLE9563_HBICHGBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGBNK2(uint16_t u16_data)
{
  TLE9563->HB_ICHG_BNK2.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_010);
  TLE9563_setBankReg(TLE9563_HBICHGBNK2_ADDR, DEVICE_regBank_010, u16_data);
}

/** \brief Gets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGBNK2(void)
{
  TLE9563_getBankReg(TLE9563_HBICHGBNK2_ADDR, DEVICE_regBank_010);
}

/** \brief Sets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGBNK4(uint16_t u16_data)
{
  TLE9563->HB_ICHG_BNK4.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_100);
  TLE9563_setBankReg(TLE9563_HBICHGBNK4_ADDR, DEVICE_regBank_100, u16_data);
}

/** \brief Gets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGBNK4(void)
{
  TLE9563_getBankReg(TLE9563_HBICHGBNK4_ADDR, DEVICE_regBank_100);
}

/** \brief Sets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGBNK5(uint16_t u16_data)
{
  TLE9563->HB_ICHG_BNK5.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_101);
  TLE9563_setBankReg(TLE9563_HBICHGBNK5_ADDR, DEVICE_regBank_101, u16_data);
}

/** \brief Gets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGBNK5(void)
{
  TLE9563_getBankReg(TLE9563_HBICHGBNK5_ADDR, DEVICE_regBank_101);
}

/** \brief Sets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGBNK6(uint16_t u16_data)
{
  TLE9563->HB_ICHG_BNK6.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_110);
  TLE9563_setBankReg(TLE9563_HBICHGBNK6_ADDR, DEVICE_regBank_110, u16_data);
}

/** \brief Gets the device register for HB charge/discharge currents for PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGBNK6(void)
{
  TLE9563_getBankReg(TLE9563_HBICHGBNK6_ADDR, DEVICE_regBank_110);
}

/** \brief Sets the device register for HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBICHGMAX(uint16_t u16_data)
{
  TLE9563->HB_ICHG_MAX.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_HBICHGMAX_ADDR, u16_data);
}

/** \brief Gets the device register for HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getHBICHGMAX(void)
{
  TLE9563_getReg(TLE9563_HBICHGMAX_ADDR);
}

/** \brief Sets the device register for HBx pre-charge/pre-discharge initialization configuration in PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBPCHGINITBNK0(uint16_t u16_data)
{
  TLE9563->HB_PCHG_INIT_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_HBPCHGINITBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for HBx pre-charge/pre-discharge initialization configuration in PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBPCHGINITBNK0(void)
{
  TLE9563_getBankReg(TLE9563_HBPCHGINITBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for HBx pre-charge/pre-discharge initialization configuration in PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBPCHGINITBNK1(uint16_t u16_data)
{
  TLE9563->HB_PCHG_INIT_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_HBPCHGINITBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for HBx pre-charge/pre-discharge initialization configuration in PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBPCHGINITBNK1(void)
{
  TLE9563_getBankReg(TLE9563_HBPCHGINITBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for HBx pre-charge/pre-discharge initialization configuration in PWM operation via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setHBPCHGINITBNK2(uint16_t u16_data)
{
  TLE9563->HB_PCHG_INIT_BNK2.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_010);
  TLE9563_setBankReg(TLE9563_HBPCHGINITBNK2_ADDR, DEVICE_regBank_010, u16_data);
}

/** \brief Gets the device register for HBx pre-charge/pre-discharge initialization configuration in PWM operation via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getHBPCHGINITBNK2(void)
{
  TLE9563_getBankReg(TLE9563_HBPCHGINITBNK2_ADDR, DEVICE_regBank_010);
}

/** \brief Sets the device register for HBx inputs TDON configuration via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTDONHBCTRLBNK0(uint16_t u16_data)
{
  TLE9563->TDON_HB_CTRL_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_TDONHBCTRLBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for HBx inputs TDON configuration via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTDONHBCTRLBNK0(void)
{
  TLE9563_getBankReg(TLE9563_TDONHBCTRLBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for HBx inputs TDON configuration via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTDONHBCTRLBNK1(uint16_t u16_data)
{
  TLE9563->TDON_HB_CTRL_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_TDONHBCTRLBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for HBx inputs TDON configuration via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTDONHBCTRLBNK1(void)
{
  TLE9563_getBankReg(TLE9563_TDONHBCTRLBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for HBx inputs TDON configuration via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTDONHBCTRLBNK2(uint16_t u16_data)
{
  TLE9563->TDON_HB_CTRL_BNK2.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_010);
  TLE9563_setBankReg(TLE9563_TDONHBCTRLBNK2_ADDR, DEVICE_regBank_010, u16_data);
}

/** \brief Gets the device register for HBx inputs TDON configuration via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTDONHBCTRLBNK2(void)
{
  TLE9563_getBankReg(TLE9563_TDONHBCTRLBNK2_ADDR, DEVICE_regBank_010);
}

/** \brief Sets the device register for HBx TDOFF configuration via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTDOFFHBCTRLBNK0(uint16_t u16_data)
{
  TLE9563->TDOFF_HB_CTRL_BNK0.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_000);
  TLE9563_setBankReg(TLE9563_TDOFFHBCTRLBNK0_ADDR, DEVICE_regBank_000, u16_data);
}

/** \brief Gets the device register for HBx TDOFF configuration via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTDOFFHBCTRLBNK0(void)
{
  TLE9563_getBankReg(TLE9563_TDOFFHBCTRLBNK0_ADDR, DEVICE_regBank_000);
}

/** \brief Sets the device register for HBx TDOFF configuration via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTDOFFHBCTRLBNK1(uint16_t u16_data)
{
  TLE9563->TDOFF_HB_CTRL_BNK1.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_001);
  TLE9563_setBankReg(TLE9563_TDOFFHBCTRLBNK1_ADDR, DEVICE_regBank_001, u16_data);
}

/** \brief Gets the device register for HBx TDOFF configuration via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTDOFFHBCTRLBNK1(void)
{
  TLE9563_getBankReg(TLE9563_TDOFFHBCTRLBNK1_ADDR, DEVICE_regBank_001);
}

/** \brief Sets the device register for HBx TDOFF configuration via SPI with according register bank
 * 
 *  \param uint16_t u16_data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setTDOFFHBCTRLBNK2(uint16_t u16_data)
{
  TLE9563->TDOFF_HB_CTRL_BNK2.reg = ((uint16_t)u16_data | (uint16_t)DEVICE_regBank_010);
  TLE9563_setBankReg(TLE9563_TDOFFHBCTRLBNK2_ADDR, DEVICE_regBank_010, u16_data);
}

/** \brief Gets the device register for HBx TDOFF configuration via SPI with according register bank
 * 
 *  \return void no return value
 */
void TLE9563_getTDOFFHBCTRLBNK2(void)
{
  TLE9563_getBankReg(TLE9563_TDOFFHBCTRLBNK2_ADDR, DEVICE_regBank_010);
}

