jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/** \brief Sets the device register for Brake control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setBRAKE(uint16_t u16_data)
{
  TLE9563->BRAKE.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_BRAKE_ADDR, u16_data);
}

/** \brief Gets the device register for Brake control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getBRAKE(void)
{
  TLE9563_getReg(TLE9563_BRAKE_ADDR);
}

/** \brief Sets the device register for CAN Selective Wake Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKCTRL(uint16_t u16_data)
{
  TLE9563->SWK_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for CAN Selective Wake Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKCTRL(void)
{
  TLE9563_getReg(TLE9563_SWKCTRL_ADDR);
}

/** \brief Sets the device register for SWK Bit Timing Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKBTL1CTRL(uint16_t u16_data)
{
  TLE9563->SWK_BTL1_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKBTL1CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Bit Timing Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKBTL1CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKBTL1CTRL_ADDR);
}

/** \brief Sets the device register for SWK WUF Identifier bits 28...13 via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKID1CTRL(uint16_t u16_data)
{
  TLE9563->SWK_ID1_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKID1CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK WUF Identifier bits 28...13 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKID1CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKID1CTRL_ADDR);
}

/** \brief Sets the device register for SWK WUF Identifier bits 12...0 via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKID0CTRL(uint16_t u16_data)
{
  TLE9563->SWK_ID0_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKID0CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK WUF Identifier bits 12...0 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKID0CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKID0CTRL_ADDR);
}

/** \brief Sets the device register for SWK WUF Identifier Mask bits 28...13 via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKMASKID1CTRL(uint16_t u16_data)
{
  TLE9563->SWK_MASK_ID1_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKMASKID1CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK WUF Identifier Mask bits 28...13 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKMASKID1CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKMASKID1CTRL_ADDR);
}

/** \brief Sets the device register for SWK WUF Identifier Mask bits 12...0 via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKMASKID0CTRL(uint16_t u16_data)
{
  TLE9563->SWK_MASK_ID0_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKMASKID0CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK WUF Identifier Mask bits 12...0 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKMASKID0CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKMASKID0CTRL_ADDR);
}

/** \brief Sets the device register for SWK Frame Data Length Code Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKDLCCTRL(uint16_t u16_data)
{
  TLE9563->SWK_DLC_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKDLCCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Frame Data Length Code Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKDLCCTRL(void)
{
  TLE9563_getReg(TLE9563_SWKDLCCTRL_ADDR);
}

/** \brief Sets the device register for SWK Data7-Data6 Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKDATA3CTRL(uint16_t u16_data)
{
  TLE9563->SWK_DATA3_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKDATA3CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Data7-Data6 Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKDATA3CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKDATA3CTRL_ADDR);
}

/** \brief Sets the device register for SWK Data5-Data4 Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKDATA2CTRL(uint16_t u16_data)
{
  TLE9563->SWK_DATA2_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKDATA2CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Data5-Data4 Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKDATA2CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKDATA2CTRL_ADDR);
}

/** \brief Sets the device register for SWK Data3-Data2 Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKDATA1CTRL(uint16_t u16_data)
{
  TLE9563->SWK_DATA1_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKDATA1CTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Data3-Data2 Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKDATA1CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKDATA1CTRL_ADDR);
}

/** \brief Sets the device register for SWK Data1-Data0 Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKDATA0CTRL(uint16_t u16_data)
{
  TLE9563->SWK_DATA0_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKDATA0CTRL_ADDR, u16_data);
}

