jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/** \brief Gets the device register for SWK Data1-Data0 Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKDATA0CTRL(void)
{
  TLE9563_getReg(TLE9563_SWKDATA0CTRL_ADDR);
}

/** \brief Sets the device register for CAN FD Configuration Control Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKCANFDCTRL(uint16_t u16_data)
{
  TLE9563->SWK_CAN_FD_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKCANFDCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for CAN FD Configuration Control Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKCANFDCTRL(void)
{
  TLE9563_getReg(TLE9563_SWKCANFDCTRL_ADDR);
}

/** \brief Sets the device register for SWK Oscillator Trimming and option Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKOSCTRIMCTRL(uint16_t u16_data)
{
  TLE9563->SWK_OSC_TRIM_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKOSCTRIMCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Oscillator Trimming and option Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKOSCTRIMCTRL(void)
{
  TLE9563_getReg(TLE9563_SWKOSCTRIMCTRL_ADDR);
}

/** \brief Gets the device register for SWK Oscillator Calibration Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKOSCCALSTAT(void)
{
  TLE9563_getReg(TLE9563_SWKOSCCALSTAT_ADDR);
}

/** \brief Sets the register RAM copy for SWK Oscillator Calibration Register
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamSWKOSCCALSTAT(uint16_t u16_data)
{
  TLE9563->SWK_OSC_CAL_STAT.reg = (uint16_t)u16_data;
}

/** \brief Sets the device register for Clock Data Recovery Control Register via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKCDRCTRL(uint16_t u16_data)
{
  TLE9563->SWK_CDR_CTRL.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKCDRCTRL_ADDR, u16_data);
}

/** \brief Gets the device register for Clock Data Recovery Control Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKCDRCTRL(void)
{
  TLE9563_getReg(TLE9563_SWKCDRCTRL_ADDR);
}

/** \brief Sets the device register for SWK Clock Data Recovery Limit Control via SPI
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_setSWKCDRLIMIT(uint16_t u16_data)
{
  TLE9563->SWK_CDR_LIMIT.reg = (uint16_t)u16_data;
  TLE9563_setReg(TLE9563_SWKCDRLIMIT_ADDR, u16_data);
}

/** \brief Gets the device register for SWK Clock Data Recovery Limit Control via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKCDRLIMIT(void)
{
  TLE9563_getReg(TLE9563_SWKCDRLIMIT_ADDR);
}

/** \brief Gets the device register for Supply Voltage Fail Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSUPSTAT(void)
{
  TLE9563_getReg(TLE9563_SUPSTAT_ADDR);
}

/** \brief Clears the device register for Supply Voltage Fail Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrSUPSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_SUPSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Supply Voltage Fail Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamSUPSTAT(uint16_t u16_data)
{
  TLE9563->SUP_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Thermal Protection Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getTHERMSTAT(void)
{
  TLE9563_getReg(TLE9563_THERMSTAT_ADDR);
}

/** \brief Clears the device register for Thermal Protection Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrTHERMSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_THERMSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Thermal Protection Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamTHERMSTAT(uint16_t u16_data)
{
  TLE9563->THERM_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Device Information Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getDEVSTAT(void)
{
  TLE9563_getReg(TLE9563_DEVSTAT_ADDR);
}

/** \brief Clears the device register for Device Information Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrDEVSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_DEVSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Device Information Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamDEVSTAT(uint16_t u16_data)
{
  TLE9563->DEV_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Bus Communication Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getBUSSTAT(void)
{
  TLE9563_getReg(TLE9563_BUSSTAT_ADDR);
}

/** \brief Clears the device register for Bus Communication Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrBUSSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_BUSSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Bus Communication Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamBUSSTAT(uint16_t u16_data)
{
  TLE9563->BUS_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Wake-up Source and Information Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getWKSTAT(void)
{
  TLE9563_getReg(TLE9563_WKSTAT_ADDR);
}

/** \brief Clears the device register for Wake-up Source and Information Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrWKSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_WKSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Wake-up Source and Information Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamWKSTAT(uint16_t u16_data)
{
  TLE9563->WK_STAT.reg = (uint16_t)u16_data;
}

