jassony/infineon2b6/TLE9563_LLD/src/TLE9563_RegLayer.c
/** \brief Gets the device register for WK Input Level via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getWKLVLSTAT(void)
{
  TLE9563_getReg(TLE9563_WKLVLSTAT_ADDR);
}

/** \brief Sets the register RAM copy for WK Input Level
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamWKLVLSTAT(uint16_t u16_data)
{
  TLE9563->WK_LVL_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for High-Side Switch Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getHSOLOCOTSTAT(void)
{
  TLE9563_getReg(TLE9563_HSOLOCOTSTAT_ADDR);
}

/** \brief Clears the device register for High-Side Switch Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrHSOLOCOTSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_HSOLOCOTSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for High-Side Switch Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamHSOLOCOTSTAT(uint16_t u16_data)
{
  TLE9563->HS_OL_OC_OT_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for General Status register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getGENSTAT(void)
{
  TLE9563_getReg(TLE9563_GENSTAT_ADDR);
}

/** \brief Sets the register RAM copy for General Status register
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamGENSTAT(uint16_t u16_data)
{
  TLE9563->GEN_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Turn-on/off delay regulation register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getTDREG(void)
{
  TLE9563_getReg(TLE9563_TDREG_ADDR);
}

/** \brief Sets the register RAM copy for Turn-on/off delay regulation register
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamTDREG(uint16_t u16_data)
{
  TLE9563->TDREG.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Drain-source overvoltage via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getDSOV(void)
{
  TLE9563_getReg(TLE9563_DSOV_ADDR);
}

/** \brief Clears the device register for Drain-source overvoltage via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrDSOV(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_DSOV_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Drain-source overvoltage
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamDSOV(uint16_t u16_data)
{
  TLE9563->DSOV.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Effective MOSFET turn.on/off delay - HB1 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getEFFTDONOFF1(void)
{
  TLE9563_getReg(TLE9563_EFFTDONOFF1_ADDR);
}

/** \brief Sets the register RAM copy for Effective MOSFET turn.on/off delay - HB1
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamEFFTDONOFF1(uint16_t u16_data)
{
  TLE9563->EFF_TDON_OFF1.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Effective MOSFET turn.on/off delay - HB 2 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getEFFTDONOFF2(void)
{
  TLE9563_getReg(TLE9563_EFFTDONOFF2_ADDR);
}

/** \brief Sets the register RAM copy for Effective MOSFET turn.on/off delay - HB 2
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamEFFTDONOFF2(uint16_t u16_data)
{
  TLE9563->EFF_TDON_OFF2.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Effective MOSFET turn.on/off delay - HB3 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getEFFTDONOFF3(void)
{
  TLE9563_getReg(TLE9563_EFFTDONOFF3_ADDR);
}

/** \brief Sets the register RAM copy for Effective MOSFET turn.on/off delay - HB3
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamEFFTDONOFF3(uint16_t u16_data)
{
  TLE9563->EFF_TDON_OFF3.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for MOSFET rise/fall time - HB1 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getTRISEFALL1(void)
{
  TLE9563_getReg(TLE9563_TRISEFALL1_ADDR);
}

/** \brief Sets the register RAM copy for MOSFET rise/fall time - HB1
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamTRISEFALL1(uint16_t u16_data)
{
  TLE9563->TRISE_FALL1.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for MOSFET rise/fall time - HB2 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getTRISEFALL2(void)
{
  TLE9563_getReg(TLE9563_TRISEFALL2_ADDR);
}

/** \brief Sets the register RAM copy for MOSFET rise/fall time - HB2
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamTRISEFALL2(uint16_t u16_data)
{
  TLE9563->TRISE_FALL2.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for MOSFET rise/fall time - HB3 via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getTRISEFALL3(void)
{
  TLE9563_getReg(TLE9563_TRISEFALL3_ADDR);
}

/** \brief Sets the register RAM copy for MOSFET rise/fall time - HB3
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamTRISEFALL3(uint16_t u16_data)
{
  TLE9563->TRISE_FALL3.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Selective Wake Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKSTAT(void)
{
  TLE9563_getReg(TLE9563_SWKSTAT_ADDR);
}

/** \brief Clears the device register for Selective Wake Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_clrSWKSTAT(uint16_t u16_data)
{
  TLE9563_setReg(TLE9563_SWKSTAT_ADDR, 0x0000);
}

/** \brief Sets the register RAM copy for Selective Wake Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamSWKSTAT(uint16_t u16_data)
{
  TLE9563->SWK_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Selective Wake ECNT Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKECNTSTAT(void)
{
  TLE9563_getReg(TLE9563_SWKECNTSTAT_ADDR);
}

/** \brief Sets the register RAM copy for Selective Wake ECNT Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamSWKECNTSTAT(uint16_t u16_data)
{
  TLE9563->SWK_ECNT_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Selective Wake CDR Status via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getSWKCDRSTAT(void)
{
  TLE9563_getReg(TLE9563_SWKCDRSTAT_ADDR);
}

/** \brief Sets the register RAM copy for Selective Wake CDR Status
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamSWKCDRSTAT(uint16_t u16_data)
{
  TLE9563->SWK_CDR_STAT.reg = (uint16_t)u16_data;
}

/** \brief Gets the device register for Family and Product Identification Register via SPI
 * 
 *  \return void no return value
 */
void TLE9563_getFAMPRODSTAT(void)
{
  TLE9563_getReg(TLE9563_FAMPRODSTAT_ADDR);
}

/** \brief Sets the register RAM copy for Family and Product Identification Register
 * 
 *  \param uint16_t data to be written
 * 
 *  \return void no return value
 */
void TLE9563_updateRamFAMPRODSTAT(uint16_t u16_data)
{
  TLE9563->FAM_PROD_STAT.reg = (uint16_t)u16_data;
}

